{
  "articles": [
    {
      "title": "GitHub introduces dark mode and auto-merge pull request",
      "body": "GitHub today announced a bunch of new features at its virtual GitHub Universe conference including dark mode, auto-merge pull requests, and Enterprise Server 3.0. In the past couple of years, almost all major apps have rolled out a dark theme for its users, so why not GitHub?",
      "excerpt": "GitHub today announced a bunch of new features at...",
      "id": "RkGfMjN"
    },
    {
      "title": "What’s multi-cloud? And why should developers care?",
      "body": "Most developers don’t care about multi-cloud. But they should, because it’s a key trend among enterprises. Atlassian, for example, is typically a single-cloud SaaS vendor. Its products, such as Jira, Confluence, and Bitbucket, all run on AWS. But Atlassian also offers...",
      "excerpt": "Most developers don’t care about multi-cloud. But ...",
      "id": "xhxdF0O"
    },
    {
      "title": "Here is how to make your website more accessible",
      "body": "An accessible website is one that’s optimized for all people, including those with disabilities. Accessibility encompasses all disabilities that affect access to the Web, including visual, auditory, physical, speech, cognitive, and neurological disabilities. Websites that...",
      "excerpt": "An accessible website is one that’s optimized for ...",
      "id": "wuU2W0T"
    },
    {
      "title": "Why open ecosystems are the future of app development",
      "body": "When app stores entered the mainstream tech culture, they exposed developers to an audience of millions who were keen to adopt the innovative capabilities of smartphones. But as the number of apps in the stores grew, so did the challenge of competing for user...",
      "excerpt": "When app stores entered the mainstream tech cultur...",
      "id": "dY-ToGS"
    },
    {
      "title": "So you think you chose to be a software engineer?",
      "body": "Whether you’re a beginner or a veteran, odds are you’ve heard of the “impostor syndrome,” the nagging feeling that your achievements are undeserved and the fear of being exposed as a fraud. This psychological phenomenon, first identified in 1978, is common among...",
      "excerpt": "Whether you’re a beginner or a veteran, odds are y...",
      "id": "yzMsS3C"
    }
  ]
}